views/business-trip-employee/_search.php

SELECT * FROM `transport`
---
                        'allowClear' => true
                    ],
                ])->label(false)?></div>
            <div class="p-1 flex-fill"><?=$form->field($model,'transport_id')->widget(Select2::class, [
                    'data' => ArrayHelper::map(Transport::find()->asArray()->all(),'id','name'),
                    'options' => ['placeholder' => 'Транспорт ...'],
                    'pluginOptions' => [
                        'allowClear' => true
                    ],
                ])->label(false)?></div>