views/business-trip-employee/index.php

SELECT * FROM `transport` WHERE `id`=2
---
    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
            [
                'attribute' => 'id',
                'contentOptions'=>['class' => 'text-center'],
                'headerOptions' => ['class' => 'text-center'],
            ],
            [
                'attribute' => 'date_of_begin',
                'contentOptions'=>['class' => 'text-center'],
                'headerOptions' => ['class' => 'text-center'],
            ],
            'date_of_end',

            [
                'attribute' => 'employee_login',
                'filter' => User::findUsersDropdown(),
                'value' => function($model){
                    return User::getFullNameByUsername($model->employee_login);
                },
                'contentOptions'=>['class' => 'text-center'],
                'headerOptions' => ['class' => 'text-center'],
            ],
            [
                'attribute' => 'transport_id',
                'filter'=>ArrayHelper::map(Transport::find()->asArray()->all(),'id','name'),
                'value'=>'transport.name',