views/label/_label_tab.php

                <h6>Параметры Prepress:</h6>
                <h6>Перевывод необходим:</h6>
                <? if (!empty($label->combination))
                    $defect_forms=Form::find()->where(['not',['form_defect_id'=>null]])
                    ->andWhere(['combination_id'=>$label->combination->combination_id])
                    ->all();
                else
                    $defect_forms=Form::find()->where(['not',['form_defect_id'=>null]])
                    ->andWhere(['label_id'=>$label->id])
                    ->all();
---
SELECT * FROM `form` WHERE (NOT (`form_defect_id` IS NULL)) AND ((`label_id`=7) OR (`combination_id` IN (6, 4, 7)))
SELECT * FROM `form` WHERE (NOT (`form_defect_id` IS NULL)) AND (`label_id`=5)

            <div class="col">
                <h6>Параметры Лаборатория:</h6>
                <h6>Конверт: <? if (!empty($label->combination->combination_id)):?>
                        <? echo '<span class="badge rounded-pill bg-secondary">'.Form::find()->where(['combination_id'=>$label->combination])
                                ->one()->envelope->idWithColor.'</span>'?>
                    <? else: ?>
                        <? echo '<span class="badge rounded-pill bg-secondary">'.Form::find()->where(['label_id'=>$label->id])->one()->envelope->idWithColor.'</span>'?>
---
SELECT * FROM `envelope` WHERE `id`=10
SELECT * FROM `form` WHERE `combination_id` IN (6, 4, 7)
SELECT * FROM `envelope` WHERE `id`=3
SELECT * FROM `form` WHERE `label_id`=5