views/cms/customer/index.php

SELECT * FROM `customer_status`
---
    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
            'id',
            'date_of_agreement',
            [
                'attribute'=>'status_id',
                'value'=>'customerStatus',
                'filter'=>CustomerStatus::$customer_status,
            ],
            'name',
            [
                'label'=>'Менеджер',
                'attribute'=>'user_id',
                'value'=>function($model) {
                    return User::getFullNameById($model->user_id);
                },
                'filter'=>User::findUsersByGroup('manager'),
            ],
            //'subject_id',
            //'region_id',
            //'town_id',
            //'street_id',
            //'house',