views/pantone-warehouse/index.php

            [
                'attribute' =>  'pantone_id',
                'value' =>  'pantone.name',
                'filter'=>ArrayHelper::map(Pantone::find()->asArray()->all(),'id','name'),
---
SELECT * FROM `pantone`