views/order/_order_tab.php

                        'toggleButton' => ['label' => 'Расход материала', 'class' => 'btn btn-info'],
                        'centerVertical'=>true,
                    ]);
                    echo Html::ul($order->orderMaterialList, ['item' => function ($item, $index) {
                        return Html::tag(
                            'li',Html::encode($item->materialName.' Ширина: '.$item->paperWarehouse->width.'см Длина:'.$item->length.'м')
                        );
                    }]);
---
SELECT * FROM `order_material` WHERE `order_id`=34

                    'toggleButton' => ['label' => 'Перемотанные ролики', 'class' => 'btn btn-success'],
                    'centerVertical'=>true,
                ]);
                echo Html::ul($order->finishedProductsWarehouse, ['item' => function ($item, $index) {
                    if ($item->count!=null OR $item->count!=0)
                    return Html::tag(
                        'li',Html::encode(' Этикеток на ролике: '.$item->label_in_roll.'шт Кол-во роликов:'.$item->count.' шт')
                    );
                }]);
---
SELECT * FROM `finished_products_warehouse` WHERE `order_id`=34