views/order/_search.php

SELECT * FROM `customer` WHERE `status_id`='1'
SELECT * FROM `pants`
SELECT * FROM `mashine`
---
        <?=$form->field($model,'manager_login')->dropDownList(User::findUsersByGroup('manager'), [
            'prompt' => ''
        ])?>
        <?=$form->field($model,'customerId')->widget(Select2::classname(), [
            'data' => ArrayHelper::map(Customer::find()->where(['status_id' => '1'])->all(), 'id', 'name'),
            'options' => ['placeholder' => 'Выбрать заказчика ...'],
            'pluginOptions' => [
                'allowClear' => true
            ],
        ])?>
        <?= $form->field($model, 'pantsId')->widget(Select2::classname(), [
            'data' => ArrayHelper::map(Pants::find()->all(), 'id', 'name'),
            'options' => ['placeholder' => 'Выбрать штанец ...'],
            'pluginOptions' => [
                'allowClear' => true
            ],
        ])?>
        <?=$form->field($model,'mashine_id')->dropDownList(ArrayHelper::map(Mashine::find()->all(), 'id', 'name'), [
            'prompt' => 'Выберите...'
        ])?>

SELECT * FROM `order_status`
SELECT * FROM `shaft`
---
        <?=$form->field($model,'date_of_create')->widget(DateRangePicker::classname(),['presetDropdown' => true,'pluginOptions' => [
                'opens'=>'left'
            ]])?>
        <?=$form->field($model,'status_id')->dropdownList(ArrayHelper::map(OrderStatus::find()->all(), 'id', 'name'), [
            'prompt' => ''
        ])?>
        <?=$form->field($model,'shaftId')
            ->dropDownList(ArrayHelper::map(Shaft::find()->all(), 'id',
                'name'), [
                'prompt' => ''
            ])?>