views/order/_search.php

SELECT * FROM `mashine`
---
                'allowClear' => true
            ],
        ])->label(false)?>
        <?= $form->field($model, 'mashine_id')->widget(Select2::classname(), [
            'data' => ArrayHelper::map(Mashine::find()->all(),
                'id', 'name'),
            'options' => ['placeholder' => 'Выбрать машину ...'],
            'pluginOptions' => [
                'allowClear' => true,
//                'multiple' => true
            ],
        ])->label(false)?>

SELECT * FROM `order_status`
SELECT * FROM `label_status`
SELECT * FROM `shaft`
---
                    [
                'opens'=>'left'
            ]])->label(false)?>
        <?= $form->field($model, 'status_id')->widget(Select2::classname(), [
            'data' => ArrayHelper::map(OrderStatus::find()->all(),
                'id', 'name'),
            'options' => ['placeholder' => 'Статус заказа ...'],
            'pluginOptions' => [
                'allowClear' => true
            ],
        ])->label(false)?>
        <?= $form->field($model, 'label_status_id')->widget(Select2::classname(), [
            'data' => ArrayHelper::map(LabelStatus::find()
                ->all(), 'id', 'name'),
            'options' => ['placeholder' => 'Статус этикетки ...'],
            'pluginOptions' => [
                'allowClear' => true
            ],
        ])->label(false)?>
        <?= $form->field($model, 'shaft_id')->widget(Select2::classname(), [
            'data' => ArrayHelper::map(Shaft::find()->all(), 'id',
                'name'),
            'options' => ['placeholder' => 'Выбрать вал ...'],
            'pluginOptions' => [
                'allowClear' => true
            ],
        ])->label(false)?>