views/order/_search.php

SELECT * FROM `pants`
SELECT * FROM `customer` WHERE `status_id`='1'
---
                            'allowClear' => true
                        ],
                    ])->label(false)?></div>
                <div class="p-1"><?= $form->field($model, 'pantsId')->widget(Select2::class, [
                        'data' => ArrayHelper::map(Pants::find()->all(), 'id', 'id'),
                        'options' => ['placeholder' => 'Выбрать штанец ...'],
                        'pluginOptions' => [
                            'allowClear' => true
                        ],
                    ])->label(false)?></div>
                <div class="p-1"><?=$form->field($model,'customerId')->widget(Select2::class, [
                        'data' => ArrayHelper::map(Customer::find()->where(['status_id' => '1'])->all(), 'id', 'name'),
                        'options' => ['placeholder' => 'Выбрать заказчика ...'],
                        'pluginOptions' => [
                            'allowClear' => true
                        ],
                    ])->label(false)?></div>