views/order/combinate_order.php

SELECT * FROM `label` WHERE `id`=3
SELECT * FROM `order` WHERE (0=1) AND (`id` != 9) AND (`status_id`=1)
---
<!--<pre>--><?//print_r($com_temp)?><!--</pre>-->
<div class="row">
    <div class="col">
        <?=$form->field($com_temp,'order_id')->widget(Select2::classname(), [
            'data' => ArrayHelper::map(Order::find()->andWhere(['label_id'=>Label::findOne($order->label_id)
                ->combinatedLabel])
                ->andWhere(['!=', 'id',$order->id])
                ->andWhere(['status_id'=>1])->all(),
                'id', 'labelNameSplitOrderId'),
            'options' => ['placeholder' => 'Заказы для совмещения ...'],
            'pluginOptions' => [
                'allowClear' => true,
                'multiple' => true
            ],
        ])->label('Заказы доступные для совместной печати:')?>