views/order/create.php

    <div class="row">
        <div class="col">
            <?=$form->field($order,'label_id')->widget(Select2::classname(),
                ['data' => ArrayHelper::map(Label::find()->joinWith('customer')->where(['customer.manager_login'=>Yii::$app->user->identity->username])->orderBy('date_of_create DESC')->limit(100)->all(),
                    'id', 'nameSplitId'),
                'options' => ['placeholder' => 'Выбрать этикетку ...'],
                'pluginOptions' => [
                    'allowClear' => true
                ],
            ])?>
            <?=$form->field($new_label,'parent_label')->checkbox()?>
            <div class="row">
                <div class="col">
                    <?=$form->field($order,'mashine_id')->dropDownList(ArrayHelper::map(Mashine::find()->all(), 'id', 'name'), [
                        'prompt' => 'Выберите...'
                    ])?>
---
SELECT `label`.* FROM `label` LEFT JOIN `customer` ON `label`.`customer_id` = `customer`.`id` WHERE `customer`.`manager_login`='Jura' ORDER BY `date_of_create` DESC LIMIT 100
SELECT * FROM `mashine`

                    <?=$form->field($order,'order_price_with_tax')->textInput()?>
                </div>
            </div>
            <?=$form->field($order,'material_id')->widget(Select2::classname(), [
                'data' => ArrayHelper::map(Material::find()->all(), 'id', 'name'),
                'options' => ['placeholder' => 'Выбрать материал ...'],
                'pluginOptions' => [
                    'allowClear' => true
                ],
            ])?>
            <?=$form->field($order,'winding_id')->radioList(ArrayHelper::map(Winding::find()->all(),'id', 'name'),[
                'item' => function ($index, $label, $name, $checked, $value) {
                    return '<label class="radio-inline">' . Html::radio($name, $checked, ['value'  => $value]) ." $value ". Html::img(Winding::findOne($value)->image, ['width'=>'100px']) . '</label>';
                }
            ])?>
---
SELECT * FROM `material`
SELECT * FROM `winding`
SELECT * FROM `winding` WHERE `id`=1

                        [
                            'prompt' => 'Выберите...'
                        ])?>
                    <?=$form->field($order,'sleeve_id')
                        ->dropDownList(ArrayHelper::map(Sleeve::find()->all(), 'id', 'name'),
                        [
                            'prompt' => 'Выберите...'
                        ])?>
---
SELECT * FROM `sleeve`