views/pantone/_form.php

            <?= $form->field($model, 'price_euro')->textInput(['maxlength' => true]) ?>
        </div>
        <div class="col">
            <?= $form->field($model, 'pantone_kind_id')->dropDownList(ArrayHelper::map(PantoneKind::find()->asArray()->all(),'id','name')) ?>

        </div>
        <div class="col">
            <?=$form->field($model, 'mashine_list')->checkboxList(ArrayHelper::map(Mashine::find()->all(),'id','name'));?>
---
SELECT * FROM `pantone_kind`
SELECT * FROM `mashine`