controllers/EmployeeController.php

    public function actionUpdate(int $id): \yii\web\Response|string
    {
        $user=User::findOne($id);
---
SELECT * FROM `user` WHERE `id`='7'