controllers/LabelController.php

    public function actionUpdate(int $id): Response|string
    {
        $label=Label::findOne($id);
        if (!\Yii::$app->user->can('updateLabel', ['item' => $label->customer])) {
            throw new ForbiddenHttpException('Доступ запрещен');
        }
        if ($label->status_id >=9 ) {
            throw new ForbiddenHttpException('Нельзя вносить изменения в этикетку когда изготовливаются формы');
        }
        if($label->load(Yii::$app->request->post())){
---
SELECT * FROM `label` WHERE `id`='2'
SELECT * FROM `customer` WHERE `id`=2