controllers/MaterialController.php

SELECT * FROM `order` WHERE `id`='31'
SELECT * FROM `order_material` WHERE `order_id`='31'
SELECT * FROM `paper_warehouse` WHERE `id`=1
INSERT INTO `order_material` (`order_id`, `paper_warehouse_id`, `length`) VALUES (31, 1, 50)
UPDATE `paper_warehouse` SET `length`=450 WHERE `id`=1
---
    public function actionPaperConsumption($id){
            $order = Order::findOne($id);
            $new_used_paper=new OrderMaterial();
            $used_paper=OrderMaterial::find()->where(['order_id'=>$id])->all();
            if ($new_used_paper->load(Yii::$app->request->post()) && $new_used_paper->validate()) {
                $paper_from_warehouse=PaperWarehouse::findOne($new_used_paper->paper_warehouse_id);
                if($new_used_paper->length<=$paper_from_warehouse->length){
                    $new_used_paper->order_id=$id;
                    if ($new_used_paper->save()) {
                        $paper_from_warehouse->length=$paper_from_warehouse->length-$new_used_paper->length;
                        $paper_from_warehouse->save();