controllers/OrderController.php

SELECT * FROM `order` WHERE `id`='5'
SELECT * FROM `order` WHERE `id`='3'
---
	public function behaviors()
{
    return [
        'access' => [
            'class' => AccessControl::class,
            'rules' => [
                [
                    'allow' => true,
                    'actions' => ['list','create','view','create-blank'],
                    'roles' => ['manager'],
                ],
                [
                    'allow' => true,
                    'actions' => ['list','view','start-print','start-print-variable','pause-print','finish-print','finish-print-variable','continue-print','form-defect'],
                    'roles' => ['printer'],
                ],
                [
                    'allow' => true,
                    'actions' => ['list','view','start-rewind','finish-rewind','rewind','rewind-delete'],
                    'roles' => ['rewinder'],
                ],
                [
                    'allow' => true,
                    'actions' => ['list','view','start-pack','pack','pack-in','finish-pack','print-label-package','print-box-label','print-sleeve-label'],
                    'roles' => ['packer'],
                ],
                [
                    'allow' => true,
                    'actions' => ['add-from-fpwarehouse'],
                    'roles' => ['updateOwnOrderManager','manager_admin'],
                    'roleParams' => function() {
                        return ['order' => Order::findOne(['id' => Yii::$app->request->get('id')])];
                    },
                ],

SELECT * FROM `order` WHERE `id`='34'
SELECT * FROM `label` WHERE `id`=5
---
    public function actionView($id)
    {
        $order = Order::findOne($id);
        $label = Label::findOne($order->label_id);

SELECT * FROM `order` WHERE `id`='9'
---
    public function actionStartPrint($id)
    {
        $order=Order::findOne($id);

SELECT * FROM `order` WHERE `id`='4'
UPDATE `order` SET `status_id`=6, `date_of_rewind_end`='2022-06-24 09:46:35' WHERE `id`=4
---
    public function actionFinishRewind($id)
    {
        $order=Order::findOne($id);
        $order->status_id=6;
        $order->date_of_rewind_end=Yii::$app->formatter->asDatetime('now', 'php:Y-m-d H:i:s');
        $order->save();

SELECT * FROM `finished_products_warehouse` WHERE `order_id`=31
---
    public function actionRewind($id)
    {
        $order=Order::findOne($id);
        $order_roll = new ActiveDataProvider([
        'query' => FinishedProductsWarehouse::find()->where(['order_id'=>$id])
    ]);

SELECT * FROM `order` WHERE `id`='31'
SELECT * FROM `finished_products_warehouse` WHERE `order_id`='31'
---
    public function actionPack($id)
    {
        $order=Order::findOne($id);
        $order_roll = FinishedProductsWarehouse::find()->where(['order_id' => $id])->indexBy('id')->all();