controllers/OrderController.php

SELECT * FROM `order` WHERE `id`='9'
---
	public function behaviors()
{
    return [
        'access' => [
            'class' => AccessControl::class,
            'rules' => [
                [
                    'allow' => true,
                    'actions' => ['list','create','view'],
                    'roles' => ['manager'],
                ],
                [
                    'allow' => true,
                    'actions' => ['list','view','start-print','pause-print','finish-print'],
                    'roles' => ['printer'],
                ],
                [
                    'allow' => true,
                    'actions' => ['combinate-order'],
                    'roles' => ['updateOwnOrderManager','manager_admin'],
                    'roleParams' => function() {
                        return ['order' => Order::findOne(['id' => Yii::$app->request->get('id')])];
                    },
                ],

SELECT * FROM `label` WHERE `id`=7
---
    public function actionView($id)
    {
        $order = Order::findOne($id);
        $label = Label::findOne($order->label_id);