controllers/PantoneController.php

SELECT * FROM `pantone` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Pantone::findOne(['id' => $id])) !== null) {