controllers/PaperWarehouseController.php

    public function actionUploadPaperToWarehouse(){
        $paper = new ActiveDataProvider([
            'query' => UploadPaper::find()
        ]);
        $upload_paper_form=new UploadPaperForm();
        if ($upload_paper_form->load(Yii::$app->request->post())) {
            $upload_paper_list=UploadPaper::find()->orFilterWhere(['roll_id'=>$upload_paper_form->barcode])
                ->orFilterWhere(['pallet_id'=>$upload_paper_form->barcode])->all();
            foreach ($upload_paper_list as $temp){
                if (isset($temp->material->id)){
                    $paper_warehouse=new PaperWarehouse();
                    $paper_warehouse->material_id=$temp->material->id;
                    $paper_warehouse->length=$temp->length;
                    $paper_warehouse->width=$temp->width;
                    $paper_warehouse->save();
                    $temp->delete();
---
SELECT * FROM `upload_paper` WHERE (`roll_id`='00320000002200803329') OR (`pallet_id`='00320000002200803329')
INSERT INTO `paper_warehouse` (`material_id`, `length`, `width`) VALUES (1, 1950, 230)
DELETE FROM `upload_paper` WHERE `id`=34