controllers/ShipmentController.php

SELECT * FROM `shipment` WHERE `id`='5'
---
    public function behaviors()
    {
        return [
            'access' => [
                'class' => AccessControl::class,
                'rules' => [
                    [
                        'allow' => true,
                        'actions' => ['create','list','view'],
                        'roles' => ['manager'],
                    ],
                    [
                        'allow' => true,
                        'actions' => ['delete','order-add','mark-defect-roll','close-shipment'],
                        'roles' => ['updateOwnShipmentManager','manager_admin'],
                        'roleParams' => function() {
                            return ['customer' => Shipment::findOne(['id' => Yii::$app->request->get('id')])];

SELECT * FROM `shipment` WHERE `id`='3'
SELECT `order_id` FROM `shipment_order` WHERE `shipment_id`='3'
SELECT * FROM `customer` WHERE `id`=1
SELECT * FROM `label` WHERE `id` IN (1, 7, 9, 5)
SELECT * FROM `order` WHERE `id` IN (31, 1, 3, 4)
---
    public function actionView($id)
    {
        $shipment = Shipment::findOne($id);
        $orders = new ActiveDataProvider([
            'query' => Order::find()->joinWith('label')->where(['order.id'=>ShipmentOrder::find()->select('order_id')->where(['shipment_id'=>$shipment->id])->column()])
                ->orderBy(['label.customer_id'=>SORT_ASC]),
            'pagination' => [
                'pageSize' => 20,
            ],
        ]);
        $roll=FinishedProductsWarehouse::find()->where(['order_id'=>ShipmentOrder::find()->select('order_id')->where(['shipment_id'=>$id])->column()])->all();

        $route_customers = new ActiveDataProvider([
            'query' => Customer::find()->where(['id'=>$shipment->customer]),
            'pagination' => [
                'pageSize' => 20,
            ],
        ]);

SELECT * FROM `order` WHERE `id` IN (31, 1, 3, 4)
SELECT * FROM `shipment_order` WHERE `shipment_id`=3
---
    public function actionDelete($id)
    {
        $shipmentorder = ShipmentOrder::findOne(['order_id'=>$id]);

SELECT * FROM `shipment` WHERE `id`='3'
INSERT INTO `finished_products_warehouse` (`roll_count`, `label_id`, `previous_order_id`, `label_in_roll`, `packed_roll_count`, `packed_box_count`, `packed_bale_count`, `sended_roll_count`, `sended_box_count`, `sended_bale_count`) VALUES (15, 5, 31, 1000, 0, 0, 0, 0, 0, 0)
---
    public function actionSendShipment($id)
    {
        $shipment = Shipment::findOne($id);
        if ($shipment->readyToSend!=true)Yii::$app->session->setFlash('error', 'Заказы должны быть на складе готовой продукции');
        else {
            foreach($shipment->finishedProductsWarehouse as $roll){
                if($roll->roll_count>$roll->sended_roll_count) { //проверяем кол-во отправленных роликов и если меньше количества всего роликов, то создаем строку с остаточными роликами
                    $new_roll=new FinishedProductsWarehouse();
                    $new_roll->roll_count=$roll->roll_count-$roll->sended_roll_count; //остаточные ролики от разницы
                    $new_roll->label_id=$roll->label_id;
                    $new_roll->previous_order_id=$roll->order_id;
                    $new_roll->label_in_roll=$roll->label_in_roll;
                    $new_roll->save();

SELECT * FROM `shipment` WHERE `id`='5'
INSERT INTO `finished_products_warehouse` (`roll_count`, `label_id`, `previous_order_id`, `label_in_roll`, `defect_roll_count`, `defect_note`, `packed_roll_count`, `packed_box_count`, `packed_bale_count`, `sended_roll_count`, `sended_box_count`, `sended_bale_count`) VALUES (1, 5, 34, 1000, 1, 'Поцарапанные этикетки', 0, 0, 0, 0, 0, 0)
UPDATE `shipment` SET `date_of_close`='2022-08-26 15:05:17', `status_id`=2 WHERE `id`=5
---
    public function actionCloseShipment($id)
    {
        $shipment = Shipment::findOne($id);
            foreach($shipment->finishedProductsWarehouse as $roll){
                if(!empty($roll->defect_roll_count)) { //проверяем кол-во дефектных
                    $new_roll=new FinishedProductsWarehouse();
                    $new_roll->roll_count=$roll->defect_roll_count; //остаточные ролики от разницы
                    $new_roll->label_id=$roll->label_id;
                    $new_roll->previous_order_id=$roll->order_id;
                    $new_roll->label_in_roll=$roll->label_in_roll;
                    $new_roll->defect_roll_count=$roll->defect_roll_count;
                    $new_roll->defect_note=$roll->defect_note;
                    $new_roll->save();
                    $roll->roll_count=$roll->roll_count-$new_roll->roll_count;
                    $roll->packed_roll_count=$roll->packed_roll_count-$new_roll->roll_count;
                    $roll->sended_roll_count=$roll->sended_roll_count-$new_roll->roll_count;
                    $roll->defect_roll_count=null;
                    $roll->defect_note=null;
                    $roll->save();
                }
            }
            $shipment->status_id=2;
            $shipment->date_of_close=Yii::$app->formatter->asDatetime('now', 'php:Y-m-d H:i:s');
            $shipment->save();