controllers/WarehouseController.php

    public function actionIndex()
    {
        $data = Warehouse::find()->all();
---
SELECT * FROM `warehouse`

    public function actionRackList($id)
    {
        $rack=Rack::findOne($id);

        $shelfs = Shelf::find()->where(['rack_id'=>$id])->all();
---
SELECT * FROM `rack` WHERE `id`='3'
SELECT * FROM `shelf` WHERE `rack_id`='3'