views/material/paper-consumption.php

                                'centerVertical'=>true,
                            ]);
                            echo "<div id='modalContent-".$paper->paper_warehouse_id."'>";
                            echo Html::tag('p', Html::encode($paper->paperWarehouse->material->name.' Ширина: '.$paper->paperWarehouse->width.
                                'см Длина: '.$paper->paperWarehouse->length.' м'),['class'=>'small text-center','style'=>'font-size:10px']);
---
SELECT * FROM `material` WHERE `id`=1
SELECT * FROM `paper_warehouse` WHERE `id`=1