views/material/stock-on-hand-paper.php

SELECT `material`.* FROM `material` LEFT JOIN `material_group` ON `material`.`material_group_id` = `material_group`.`id`
SELECT * FROM `material_group`
---
    ]
])?>

<?=$form->field($searchModel,'search_material_id')->dropDownList(ArrayHelper::map(Material::find()->joinWith('materialGroup')->asArray()->all(), 'id', 'name','materialGroup.name'),['prompt'=>''])?>
<?=$form->field($searchModel,'search_material_group_id')->dropDownList(ArrayHelper::map(MaterialGroup::find()->asArray()->all(),'id','name'),['prompt'=>''])?>