<?php

/** @var yii\web\View $this */

//use yii\helpers\Html;
use yii\bootstrap5\Html;

$this->title = 'О компании';
$this->params['breadcrumbs'][] = $this->title;
?>
<div class="site-about">
    <h1><?= Html::encode($this->title) ?></h1>

    <p>
        Комплекс типография - это система для контроля, учета технологического процесса работы типографии
    </p>
    <p>
        Типография ООО “Альпринт” с 1995 года одной из первых в Поволжье стала осваивать производство самоклеящейся этикетки. За долгие годы работы мы завоевали доверие тысяч клиентов в городах миллионниках и субъектах Российской Федерации.
    </p>
    <p>
        Грамотный и ответственный подход, скорость, качество, надежность - это главные принципы нашей компании.
    </p>
    <p>
        От дизайна и до печати тиража все отделы объединены в единую производственную цепь, где данные передаются от этапа к этапу. И не имеет никакого значения, печатается ли маленький разовый заказ или миллионный тираж, продукция всегда соответствует самым высоким требованиям.
    </p>
    <p>
        Менеджерами типографии разрабатываются жесткие графики поставок продукции. Наша основополагающая цель - это индивидуальный подход к каждому клиенту с учетом всех его пожеланий.
    </p>

    <!--<code><?= __FILE__ ?></code>-->
</div>
