views/site/tab-prepress.php

SELECT `order`.* FROM `order` LEFT JOIN `label` ON `order`.`label_id` = `label`.`id` WHERE (`order`.`status_id`=1) AND (`label`.`status_id` IN (4, 5)) ORDER BY `date_of_sale` LIMIT 3
---
            <div class="p-1">
                <?php Pjax::begin(); ?>
                <ol class="list-group list-group-numbered">
                    <?foreach(Order::find()->andFilterWhere(['order.status_id'=>1])->joinWith('label')->andFilterWhere(['label.status_id'=>[4,5]])->orderBy(['date_of_sale'=>SORT_ASC])->limit(3)->all() as $order):?>