views/site/tab-packer.php

            <div class="p-1">
                <?php Pjax::begin(); ?>
                <ol class="list-group list-group-numbered">
                    <?foreach(Order::find()->andFilterWhere(['status_id'=>6])->orderBy(['date_of_sale'=>SORT_ASC])->limit(3)->all() as $order):?>
---
SELECT * FROM `order` WHERE `status_id`=6 ORDER BY `date_of_sale` LIMIT 3