views/cms/label/index.php

SELECT * FROM `customer`
---
            'date_of_design',
            'date_of_prepress',

            [
                'attribute' => 'customer_id',
                'value' => 'customer.name',
                'filter' => ArrayHelper::map(Customer::find()->asArray()->all(),'id','name'),
            ],