views/enterprise-cost/_search.php

SELECT * FROM `enterprise_cost_service`
---
                    'pluginOptions' => ['locale' => ['format' => 'Y-m-d'],'selectOnClose'=>false],
                    'options' => ['placeholder' => 'Выберите дату...']
                ])->label(false)?></div>
            <div class="p-1 flex-fill"><?php echo $form->field($model,'service_id')->widget(Select2::class, [
                    'data' => ArrayHelper::map(EnterpriseCostService::find()->asArray()->all(),'id','name'),
                    'options' => ['placeholder' => 'Выбрать услугу'],
                    'pluginOptions' => [
                        'allowClear' => true
                    ],
                ])->label(false)?></div>