views/enterprise-cost/index.php

SELECT * FROM `enterprise_cost_service` WHERE `id`=7
SELECT * FROM `enterprise_cost_service`
---
    </p>

    <?ActiveForm::begin(['method'=>'post'])?>
    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
            'id',
            'date',

            [
                'attribute'=>'login',
                'value'=>function($model){
                return User::getFullNameByUsername($model->login);
                },
                'filter'=>User::findUsersDropdown(),
            ],
            [
                    'attribute'=>'service_id',
                    'value'=>'enterpriseCostService.name',
                    'filter'=>ArrayHelper::map(EnterpriseCostService::find()->asArray()->all(),'id','name'),
            ],
            [
                    'attribute'=>'order_id',