views/pants/index.php

            [
                    'attribute'=>'shaft_id',
                    'value'=>'shaft.name',
                    'filter'=>ArrayHelper::map(Shaft::find()->asArray()->all(),'id','name'),
---
SELECT * FROM `shaft`

            [
                'attribute' => 'pants_kind_id',
                'value' => 'pantsKind.name',
                'filter'=>ArrayHelper::map(PantsKind::find()->asArray()->all(),'id','name'),
---
SELECT * FROM `pants_kind`