rbac/AllowToEditOrder.php

SELECT * FROM `customer` WHERE `id`=3
---
    public function execute($user, $item, $params)
    {
        return isset($params['order']) ? $params['order']->customer
                ->manager_login == User::findIdentity($user)->username : false;