views/shipment/_route_tab.php

    ],
    ['label'=>'Коробки и тюки',
        'value'=>function($model){
            $orders=Customer::findOne($model->id)->getCustomerShipmentOrder(Yii::$app->request->get('id'));
//            print_r($request->get('id'));
            if (isset($orders))
                foreach($orders as $order){
                    $rolls=Order::findOne($order)->finishedProductsWarehouse;
---
SELECT * FROM `customer` WHERE `id`=1
SELECT * FROM `finished_products_warehouse` WHERE `order_id`=31
SELECT * FROM `order` WHERE `id`='31'