views/shipment/_transport_tab.php

SELECT * FROM `transport` WHERE `id`=2
---
use app\models\Transport;

?>
<?php echo Html::tag('h6','Транспорт: ' .Html::encode(Transport::findOne($shipment->transport_id)->name))?>