views/bank-transfer/_search.php

SELECT * FROM `customer`
---
                    'type' => LabelInPlace::TYPE_HTML5,
                    'options' => ['type' => 'text']
                ])?></div>
            <div class="p-1 flex-fill"><?php echo $form->field($model,'customer_id')->widget(Select2::class, [
                    'data' => ArrayHelper::map(Customer::find()->asArray()->all(),'id','name'),
                    'options' => ['placeholder' => 'Заказчик'],
                    'pluginOptions' => [
                        'allowClear' => true
                    ],
                ])->label(false)?></div>