views/bank-transfer/index.php

SELECT * FROM `customer` WHERE `id` IN (1, 2, 4)
---
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'showFooter' => true,
        'columns' => [
            [
                'attribute' => 'customer_id',
                'value'=>'customer.name',
                'filter'=>Select2::widget([
                    'model' => $searchModel,
                    'attribute' => 'customer_id',
                    'data' => ArrayHelper::map(Customer::find()->asArray()->all(),'id','name'),
                    'options' => [
                        'prompt' => ''
                    ],
                    'pluginOptions' => [
                        'allowClear' => true,
                    ]
                ]),
                'contentOptions'=>['class' => 'text-left'],
                'headerOptions' => ['class' => 'text-left'],
            ],
            [
                'label' => 'Менеджер',
                'value'=>function($model){
                    return User::getFullNameByUsername($model->customer->manager_login);
                },
                'filter'=>Select2::widget([
                    'model' => $searchModel,
                    'attribute' => 'manager_login',
                    'data' => User::findUsersByGroup('manager'),
                    'options' => [
                        'prompt' => ''
                    ],
                    'pluginOptions' => [
                        'allowClear' => true,
                    ]
                ]),
                'contentOptions'=>['class' => 'text-left'],
                'headerOptions' => ['class' => 'text-left'],
            ],
            [