views/cms/auth-assignment/index.php

SELECT * FROM `auth_item`
SELECT * FROM `auth_item` WHERE `name`='admin'
---
                    'filter'=>User::findUsersIdDropdown(),
                    'value'=>function($model){return User::getFullNameById($model->user_id); },
            ],
            [
                    'attribute'=>'item_name',
                    'filter'=>ArrayHelper::map(AuthItem::find()->asArray()->all(),'name','description'),
                    'value'=>function($model){
                        return AuthItem::findOne($model->item_name)->description;
                    },
            ],