models/CalcCommonParam.php

SELECT * FROM `calc_common_param`
---
    public static function getCommonParam(){
        $common_param=CalcCommonParam::find()->all();