models/Customer.php

    public function getCustomerShipmentOrder($shipment_id){
        return Order::find()->joinWith(['shipmentOrder','label'])->where(['shipment_order.shipment_id'=>$shipment_id,'label.customer_id'=>$this->id])->column();
---
SELECT `order`.* FROM `order` LEFT JOIN `shipment_order` ON `order`.`id` = `shipment_order`.`order_id` LEFT JOIN `label` ON `order`.`label_id` = `label`.`id` WHERE (`shipment_order`.`shipment_id`='3') AND (`label`.`customer_id`=1)