models/Label.php

	public function getCombinatedLabel(){
	    return ArrayHelper::map(CombinationForm::find()->where(['combination_id'=>$this->combination->combination_id])->all(),'label_id','label_id');
---
SELECT * FROM `combination_form` WHERE `combination_id` IS NULL

    public function getManagerName(){
        $user=User::findByUserName($this->customer->manager_login);
---
SELECT * FROM `customer` WHERE `id`=1