models/Order.php

    public function getOrderStatusName(){
        return $this->orderStatus->name;
---
SELECT * FROM `order_status` WHERE 0=1

    public function getFullName(){
        $user=User::findByUserName($this->label->customer->manager_login);
---
SELECT * FROM `label` WHERE `id`=5
SELECT * FROM `customer` WHERE `id`=1