models/Order.php

SELECT * FROM `order_status` WHERE 0=1
---
    public function getOrderStatusName(){
        return $this->orderStatus->name;

SELECT * FROM `customer` WHERE `id`=1
SELECT * FROM `label` WHERE `id`=5
---
    public function getFullName(){
        $user=User::findByUserName($this->label->customer->manager_login);