models/Pantone.php

    public function afterFind()
    {
        $this->mashine_list = MashinePantone::find()->select('mashine_id')->where(['pantone_id'=>$this->id])->asArray()->column();
---
SELECT `mashine_id` FROM `mashine_pantone` WHERE `pantone_id`=1