models/Shipment.php

    public function getReadyToSend(){
        foreach ($this->order as $order){
---
SELECT * FROM `order` WHERE `id` IN (31, 1, 3, 4)