models/StockOnHandPaper.php

    public function StockOnHand($stock_date){
        //обрабатываем в цикле ролики со склада бумаги
        foreach ($this->paperWarehouse as $paper_warehouse){
            //приход с периода выборки и до сегодняшнего дня отнимаем
            if(date_create($paper_warehouse->date_of_create) <= date_create($stock_date)){
                //обрабатываем в цикле введенный расход по каждому ролику со склада
                foreach($paper_warehouse->orderMaterial as $order_material){
---
SELECT * FROM `order_material` WHERE `paper_warehouse_id`=3