models/User.php

    public static function findIdentity($id)
    {
        return !empty(self::findOne($id)) ? new static(self::findOne($id)) : null;
---
SELECT * FROM `user` WHERE `id`=1

    public static function findUsersByGroup($group)
    {
        foreach(self::find()->all() as $user){
---
SELECT * FROM `user`

    public static function findUsersIdDropdown()
    {
        foreach(self::find()->all() as $user){
---
SELECT * FROM `user`

    public static function getFullNameById($id)
    {
        foreach(self::find()->all() as $user){
---
SELECT * FROM `user`

    public static function getUserList()
    {
        $user_list=[];
        foreach(self::find()->all() as $user){
---
SELECT * FROM `user`

    public static function findByUsername($username)
    {
        foreach (self::find()->all() as $user) {
---
SELECT * FROM `user`